%%%=============================================================================
%%% @doc woap_hosts 
%%% 微信公众平台开放api接口域名
%%% @end
%%%=============================================================================
-module(woap_hosts).
-author('J <j-som@foxmail.com>').


-export([
    get_1st/0,
    get_2nd/0,
    get_all/0
]).

%%------------------------------------------------------------------------------
%% @doc get_all 
%% 通用域名(api.weixin.qq.com)，使用该域名将访问官方指定就近的接入点；
%% 通用异地容灾域名(api2.weixin.qq.com)，当上述域名不可访问时可改访问此域名；
%% 上海域名(sh.api.weixin.qq.com)，使用该域名将访问上海的接入点；
%% 深圳域名(sz.api.weixin.qq.com)，使用该域名将访问深圳的接入点；
%% 香港域名(hk.api.weixin.qq.com)，使用该域名将访问香港的接入点。
%% @end
%%------------------------------------------------------------------------------
get_all() ->
    [
        "api.weixin.qq.com",
        "api2.weixin.qq.com",
        "sh.api.weixin.qq.com",
        "sz.api.weixin.qq.com",
        "hk.api.weixin.qq.com"
    ].

%%------------------------------------------------------------------------------
%% @doc get_1st 
%% 获取最优的域名
%% @end
%%------------------------------------------------------------------------------
get_1st() ->
    "api.weixin.qq.com".

%%------------------------------------------------------------------------------
%% @doc get_2nd 
%% 获取容灾域名
%% @end
%%------------------------------------------------------------------------------
get_2nd() ->
    "api2.weixin.qq.com".